resume.tex
% Created 2025-02-11 Tue 18:22
% Intended LaTeX compiler: xelatex
\documentclass[10pt,letterpaper]{article}
\usepackage[rm]{roboto}
\usepackage[defaultsans]{lato}
\usepackage{paracol}
\usepackage{fontspec}
\newfontfamily\emojifont{Noto Color Emoji}
\newfontfamily\emoji{Noto Color Emoji}
\usepackage{xltxtra}
\usepackage[T1]{fontenc}
\usepackage{mathpazo}
\usepackage[margin=1in]{geometry}
\linespread{1.3}
\usepackage{parskip}
\usepackage[svgnames]{xcolor}
\usepackage{hyperref}
\usepackage{titlesec}
\usepackage{fancyhdr}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0pt}
\pagenumbering{gobble}
\usepackage{enumitem}
\setlist{itemsep=0.4em}
\titleformat{\section}{\Large\bfseries\color{NavyBlue}}{}{0em}{}[\titlerule]
\titlespacing{\section}{0pt}{5pt}{5pt}
\titleformat{\subsection}{\bfseries\color{NavyBlue}}{}{0em}{}[\vspace{0.5em}]
\titlespacing{\subsection}{0pt}{3pt}{3pt}
\PassOptionsToPackage{hyphens}{url}
\usepackage[hyphens]{url}
\usepackage{xurl}
\usepackage{hyperref}
\hypersetup{breaklinks=true}
\urlstyle{same}
\usepackage{microtype}
\sloppy
\date{}
\title{My Resume}
\begin{document}

\section*{Introduction}
\label{sec:orgfe25a86}
This is the HTML form of my resume. There is a \href{resume.pdf}{pdf form} of my resume as well, if that's what you want.
I'm excited to hear from you!
\section*{Preston Pan}
\label{sec:org6d476f9}
\begin{minipage}[t]{0.47\textwidth}
\subsection*{CONTACT}
\label{sec:org2a864bf}
\begin{itemize}
\item 📧 \textbf{\textbf{Email:}} ret2pop@gmail.com
\item 📍 \textbf{\textbf{Location:}} Vancouver, BC, Canada
\item 🔗 \textbf{\textbf{LinkedIn:}} \href{https://www.linkedin.com/in/preston-pan-7aa364333}{https://www.linkedin.com/in/preston-pan-7aa364333}
\item 🖥️ \textbf{\textbf{GitHub:}} \href{https://github.com/ret2pop}{https://github.com/ret2pop}
\end{itemize}
\subsection*{SKILLS}
\label{sec:org2892f13}
\begin{itemize}
\item \textbf{\textbf{Programming:}} Python, Solidity, Rust, C, x86-64 Assembly, Shell
\item \textbf{\textbf{DevOps:}} Docker, Kubernetes, NixOS, declarative configurations
\item \textbf{\textbf{Blockchain:}} Aptos Move, FunC, Solidity
\item \textbf{\textbf{Tools:}} Git, Docker, NixOS, LATEX, cmake/make, Linux
\item \textbf{\textbf{Radio:}} Amateur radio (licensed); analog/digital radio tech
\end{itemize}

\vfill
\subsection*{EXPERIENCE}
\label{sec:org6ef9801}
\subsubsection*{\textbf{Software Engineer} - LayerZero Labs}
\label{sec:org8ea673e}
\begin{itemize}
\item Shipped production-ready smart contract code as part of a world-class blockchain engineering team.
\item Discovered and fixed critical vulnerabilities in TON and Aptos blockchain code, preventing potential losses of millions.
\item One of the world's few engineers proficient in FunC and TVM assembly, contributing to LayerZero’s multi-chain infrastructure.
\item Developed SDKs for Aptos blockchain RPC interaction, streamlining smart contract deployment and transaction execution.
\item Analyzed Aptos’ contract package linking, identifying a scaling limitation that triggered a major contract redesign.
\end{itemize}

\end{minipage}
\hfill
\begin{minipage}[t]{0.47\textwidth}
\subsection*{PROJECTS}
\label{sec:orge82cd19}
\subsubsection*{Stem}
\label{sec:orgfb19df5}
\begin{itemize}
\item Designed a stack-based programming language, written entirely in C.
\item Reached \#1 on HackerNews; led to an offer at LayerZero.
\end{itemize}
\subsubsection*{Cognition}
\label{sec:org4df69fe}
\begin{itemize}
\item Engineered a stack-based programming language featuring advanced metaprogramming capabilities.
\item Another blog post that reached \#1 on HackerNews
\end{itemize}
\subsubsection*{NoExcess}
\label{sec:org93f1121}
\begin{itemize}
\item Developed a Lisp-like programming language with scoping, written in C.
\end{itemize}
\subsubsection*{Server/Website}
\label{sec:orga313b21}
\begin{itemize}
\item Maintains a website/server with a blog and mindmap — runs a webring (\href{https://nullring.xyz}{nullring.xyz}).
\end{itemize}
\subsubsection*{Snake3}
\label{sec:org49e5353}
\begin{itemize}
\item Created a threaded, multiplayer snake game in C.
\item Available at \href{https://git.aberrantflux.xyz/snake3.git}{https://git.aberrantflux.xyz/snake3.git}
\end{itemize}
\subsection*{INTERESTS}
\label{sec:org1f6da6e}
\begin{itemize}
\item Cryptography, decentralized governance, Economic systems
\item low-level programming, compiler design
\item Declarative and functional programming
\end{itemize}

\vfill
\subsection*{Let's Connect}
\label{sec:orgc9f3fcc}
I'm open to opportunities in low level programming, blockchain, and cryptography. Feel free to reach out via email or Linkedin!
\end{minipage}
\end{document}
